; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-38)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room6)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room4)
(at ball26 room4)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 38
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 11 of 38
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 38
4. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 12 of 38
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 38
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 12 of 38
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 38
8. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 13 of 38
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 38
10. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 13 of 38
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 38
12. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 14 of 38
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 38
14. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 14 of 38
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 38
16. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 15 of 38
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 38
18. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 15 of 38
19. (pick ball35 room6 left)
   deleted: (at ball35 room6) (free left)
   added: (carry ball35 left)
   goals met: 15 of 38
20. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 15 of 38
21. (drop ball35 room5 left)
   deleted: (carry ball35 left)
   added: (at ball35 room5) (free left)
   goals met: 16 of 38
22. (pick ball24 room5 left)
   deleted: (at ball24 room5) (free left)
   added: (carry ball24 left)
   goals met: 16 of 38
23. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 16 of 38
24. (drop ball24 room3 left)
   deleted: (carry ball24 left)
   added: (at ball24 room3) (free left)
   goals met: 17 of 38
25. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 17 of 38
26. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 17 of 38
27. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 18 of 38
28. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 18 of 38
29. (pick ball34 room6 left)
   deleted: (at ball34 room6) (free left)
   added: (carry ball34 left)
   goals met: 18 of 38
30. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 18 of 38
31. (drop ball34 room5 left)
   deleted: (carry ball34 left)
   added: (at ball34 room5) (free left)
   goals met: 19 of 38
32. (pick ball23 room5 left)
   deleted: (at ball23 room5) (free left)
   added: (carry ball23 left)
   goals met: 19 of 38
33. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 19 of 38
34. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 20 of 38
35. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 20 of 38
36. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 38
37. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 21 of 38
38. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 21 of 38
39. (pick ball33 room6 left)
   deleted: (at ball33 room6) (free left)
   added: (carry ball33 left)
   goals met: 21 of 38
40. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 21 of 38
41. (drop ball33 room5 left)
   deleted: (carry ball33 left)
   added: (at ball33 room5) (free left)
   goals met: 22 of 38
42. (pick ball22 room5 left)
   deleted: (at ball22 room5) (free left)
   added: (carry ball22 left)
   goals met: 22 of 38
43. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 22 of 38
44. (drop ball22 room3 left)
   deleted: (carry ball22 left)
   added: (at ball22 room3) (free left)
   goals met: 23 of 38
45. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 23 of 38
46. (pick ball32 room6 left)
   deleted: (at ball32 room6) (free left)
   added: (carry ball32 left)
   goals met: 23 of 38
47. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 23 of 38
48. (drop ball32 room5 left)
   deleted: (carry ball32 left)
   added: (at ball32 room5) (free left)
   goals met: 24 of 38
49. (pick ball21 room5 left)
   deleted: (at ball21 room5) (free left)
   added: (carry ball21 left)
   goals met: 24 of 38
50. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 24 of 38
51. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 25 of 38
52. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 25 of 38
53. (pick ball31 room6 left)
   deleted: (at ball31 room6) (free left)
   added: (carry ball31 left)
   goals met: 25 of 38
54. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 25 of 38
55. (drop ball31 room5 left)
   deleted: (carry ball31 left)
   added: (at ball31 room5) (free left)
   goals met: 26 of 38
56. (pick ball20 room5 left)
   deleted: (at ball20 room5) (free left)
   added: (carry ball20 left)
   goals met: 26 of 38
57. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 26 of 38
58. (drop ball20 room3 left)
   deleted: (carry ball20 left)
   added: (at ball20 room3) (free left)
   goals met: 27 of 38
59. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 27 of 38
60. (pick ball30 room6 left)
   deleted: (at ball30 room6) (free left)
   added: (carry ball30 left)
   goals met: 27 of 38
61. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 27 of 38
62. (drop ball30 room5 left)
   deleted: (carry ball30 left)
   added: (at ball30 room5) (free left)
   goals met: 28 of 38
63. (pick ball19 room5 left)
   deleted: (at ball19 room5) (free left)
   added: (carry ball19 left)
   goals met: 28 of 38
64. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 28 of 38
65. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 29 of 38
66. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 29 of 38
67. (pick ball29 room6 left)
   deleted: (at ball29 room6) (free left)
   added: (carry ball29 left)
   goals met: 29 of 38
68. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 29 of 38
69. (drop ball29 room5 left)
   deleted: (carry ball29 left)
   added: (at ball29 room5) (free left)
   goals met: 30 of 38
70. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 30 of 38
71. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 30 of 38
72. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 31 of 38
73. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 31 of 38
74. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 31 of 38
75. (pick ball28 room6 left)
   deleted: (at ball28 room6) (free left)
   added: (carry ball28 left)
   goals met: 31 of 38
76. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 31 of 38
77. (drop ball28 room5 left)
   deleted: (carry ball28 left)
   added: (at ball28 room5) (free left)
   goals met: 32 of 38
78. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 32 of 38
79. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 32 of 38
80. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 33 of 38
81. (pick ball17 room4 left)
   deleted: (at ball17 room4) (free left)
   added: (carry ball17 left)
   goals met: 33 of 38
82. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 33 of 38
83. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 34 of 38
84. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 34 of 38
85. (pick ball27 room6 left)
   deleted: (at ball27 room6) (free left)
   added: (carry ball27 left)
   goals met: 34 of 38
86. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 34 of 38
87. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 34 of 38
88. (drop ball27 room5 left)
   deleted: (carry ball27 left)
   added: (at ball27 room5) (free left)
   goals met: 35 of 38
89. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 35 of 38
90. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 35 of 38
91. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 35 of 38
92. (drop ball25 room4 left)
   deleted: (carry ball25 left)
   added: (at ball25 room4) (free left)
   goals met: 36 of 38
93. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 36 of 38
94. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 36 of 38
95. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 37 of 38
96. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 37 of 38
97. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 37 of 38
98. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 37 of 38
99. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 38 of 38
